fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДлительностьОтпуска</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/InformationRegisters/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_ГрафикОтпусков</name>
  <resources>
    <name>ДлительностьОтпуска</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда  
    
#Область ОбработчикиСобытий


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Строка Из ОтпускаСотрудников Цикл
		Если ЗначениеЗаполнено(Строка.ДатаНачала) И ЗначениеЗаполнено(Строка.ДатаОкончания) Тогда
			Строка.ДлительностьОтпуска = РазницаВДнях(Строка.ДатаНачала, Строка.ДатаОкончания);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
    
    Для каждого Строка Из ОтпускаСотрудников Цикл   
        
        Если НЕ ЗначениеЗаполнено(Строка.ДатаНачала) ИЛИ НЕ ЗначениеЗаполнено(Строка.ДатаОкончания) ИЛИ Строка.ДатаНачала >= Строка.ДатаОкончания Тогда
            ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Неверно заполнен период в строке №%1", Строка.НомерСтроки)); 
            Отказ = Истина;  
        КонецЕсли; 
    КонецЦикла;
    
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Набор = РегистрыСведений.ВКМ_ГрафикОтпусков.СоздатьНаборЗаписей();
	//Набор.Отбор.Период.ВидСравнения = ВидСравнения.Равно;
	// Если регистр периодический, период можно ставить датой документа или началом года
	
	Для Каждого Строка Из ОтпускаСотрудников Цикл
		Запись = Набор.Добавить();
		Запись.Период = Дата; // или НачалоМесяца(Дата)
		Запись.Сотрудник = Строка.Сотрудник;
		Запись.ДатаНачала = Строка.ДатаНачала;
		Запись.ДатаОкончания = Строка.ДатаОкончания;
		Запись.ДлительностьОтпуска = Строка.ДлительностьОтпуска;
	КонецЦикла;
	
	Набор.Записать();  
	
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция РазницаВДнях(ДатаНачала, ДатаОкончания)

	Если ДатаОкончания < ДатаНачала Тогда
		Возврат 0;
	КонецЕсли;
	Возврат Цел((ДатаОкончания - ДатаНачала) / 86400) + 1;
	
КонецФункции


#КонецОбласти
#КонецЕсли
